[Survived] StringLiteral
packages/zod/src/v4/core/schemas.ts:2537:23
-               ? { code: "too_big", maximum: items.length, inclusive: true }
+               ? { code: "", maximum: items.length, inclusive: true }
Tests ran:
    successful validation
    async validation
    tuple with all optional elements

[Survived] BooleanLiteral
packages/zod/src/v4/core/schemas.ts:2537:68
-               ? { code: "too_big", maximum: items.length, inclusive: true }
+               ? { code: "too_big", maximum: items.length, inclusive: false }
Tests ran:
    successful validation
    async validation
    tuple with all optional elements

[Survived] ObjectLiteral
packages/zod/src/v4/core/schemas.ts:2537:15
-               ? { code: "too_big", maximum: items.length, inclusive: true }
+               ? {}
Tests ran:
    successful validation
    async validation
    tuple with all optional elements
