[Survived] ConditionalExpression
packages/zod/src/v3/types.ts:4091:9
-       if (!this.#cache) {
+       if (true) {

[Survived] ConditionalExpression
packages/zod/src/v3/types.ts:4091:9
-       if (!this.#cache) {
+       if (false) {

[Survived] BooleanLiteral
packages/zod/src/v3/types.ts:4091:9
-       if (!this.#cache) {
+       if (this.#cache) {

[Survived] BooleanLiteral
packages/zod/src/v3/types.ts:4095:9
-       if (!this.#cache.has(input.data)) {
+       if (this.#cache.has(input.data)) {

[Survived] ConditionalExpression
packages/zod/src/v3/types.ts:4095:9
-       if (!this.#cache.has(input.data)) {
+       if (true) {

[Survived] ConditionalExpression
packages/zod/src/v3/types.ts:4095:9
-       if (!this.#cache.has(input.data)) {
+       if (false) {

[Survived] BooleanLiteral
packages/zod/src/v3/types.ts:4190:9
-       if (!this.#cache) {
+       if (this.#cache) {

[Survived] ConditionalExpression
packages/zod/src/v3/types.ts:4190:9
-       if (!this.#cache) {
+       if (true) {

[Survived] ConditionalExpression
packages/zod/src/v3/types.ts:4190:9
-       if (!this.#cache) {
+       if (false) {

[Survived] BooleanLiteral
packages/zod/src/v3/types.ts:4194:9
-       if (!this.#cache.has(input.data)) {
+       if (this.#cache.has(input.data)) {

[Survived] ConditionalExpression
packages/zod/src/v3/types.ts:4194:9
-       if (!this.#cache.has(input.data)) {
+       if (true) {

[Survived] ConditionalExpression
packages/zod/src/v3/types.ts:4194:9
-       if (!this.#cache.has(input.data)) {
+       if (false) {

[Survived] BooleanLiteral
packages/zod/src/v3/types.ts:4426:13
-           if (!isValid(base)) return INVALID;
+           if (isValid(base)) return INVALID;

[Survived] ConditionalExpression
packages/zod/src/v3/types.ts:4426:13
-           if (!isValid(base)) return INVALID;
+           if (true) return INVALID;

[Survived] ConditionalExpression
packages/zod/src/v3/types.ts:4426:13
-           if (!isValid(base)) return INVALID;
+           if (false) return INVALID;
