[NoCoverage] ObjectLiteral
packages/zod/src/v4/core/to-json-schema.ts:172:51
-                     ...(this.target === "draft-7" ? { type: "string" } : {}),
+                     ...(this.target === "draft-7" ? {} : {}),

[NoCoverage] StringLiteral
packages/zod/src/v4/core/to-json-schema.ts:172:59
-                     ...(this.target === "draft-7" ? { type: "string" } : {}),
+                     ...(this.target === "draft-7" ? { type: "" } : {}),

[Survived] ConditionalExpression
packages/zod/src/v4/core/to-json-schema.ts:163:17
-               if (json.format === "") delete json.format; // empty format is not valid
+               if (false) delete json.format; // empty format is not valid
Tests ran:
    toJSONSchema primitive types
    toJSONSchema string formats
    toJSONSchema string patterns
  and 1 more test!

[Survived] StringLiteral
packages/zod/src/v4/core/to-json-schema.ts:163:33
-               if (json.format === "") delete json.format; // empty format is not valid
+               if (json.format === "Stryker was here!") delete json.format; // empty format is not valid
Tests ran:
    toJSONSchema primitive types
    toJSONSchema string formats
    toJSONSchema string patterns
  and 1 more test!

[Survived] ConditionalExpression
packages/zod/src/v4/core/to-json-schema.ts:169:22
-               else if (regexes.length > 1) {
+               else if (true) {
Tests ran:
    toJSONSchema string patterns

[Survived] EqualityOperator
packages/zod/src/v4/core/to-json-schema.ts:169:22
-               else if (regexes.length > 1) {
+               else if (regexes.length >= 1) {
Tests ran:
    toJSONSchema string patterns

[Survived] ConditionalExpression
packages/zod/src/v4/core/to-json-schema.ts:172:23
-                     ...(this.target === "draft-7" ? { type: "string" } : {}),
+                     ...(false ? { type: "string" } : {}),
Tests ran:
    toJSONSchema string patterns

[Survived] StringLiteral
packages/zod/src/v4/core/to-json-schema.ts:172:39
-                     ...(this.target === "draft-7" ? { type: "string" } : {}),
+                     ...(this.target === "" ? { type: "string" } : {}),
Tests ran:
    toJSONSchema string patterns
