[Killed] EqualityOperator
src/v4/core/schemas.ts:1762:38
     final.issues.push(...util.prefixIssues(key, result.issues));
   }
 
-  if (!isPresent && !isOptionalIn && result.value === undefined) {
+  if (!isPresent && !isOptionalIn && result.value !== undefined) {
     if (!result.issues.length) {
       final.issues.push({
killedBy: catch/prefault/default
statusReason: [
  {
    "code": "invalid_type",
    "expected": "nonoptional",
    "path": [
      "d"
    ],
    "message": "Invalid input: expected nonoptional, received undefined"

[Killed] LogicalOperator
src/v4/core/schemas.ts:1762:7
     final.issues.push(...util.prefixIssues(key, result.issues));
   }
 
-  if (!isPresent && !isOptionalIn && result.value === undefined) {
+  if (!isPresent || !isOptionalIn && result.value === undefined) {
     if (!result.issues.length) {
       final.issues.push({
killedBy: partial with mask
statusReason: [
  {
    "code": "invalid_type",
    "expected": "nonoptional",
    "path": [
      "name"
    ],
    "message": "Invalid input: expected nonoptional, received undefined"
