[Survived] ConditionalExpression
packages/zod/src/v4/core/schemas.ts:1762:7
-     if (!isPresent && !isOptionalIn && result.value === undefined) {
+     if (false) {
Tests ran:
    partial with mask
    partial with mask -- ignore falsy values
    catch/prefault/default
  and 5 more tests!

[Survived] BooleanLiteral
packages/zod/src/v4/core/schemas.ts:1762:7
-     if (!isPresent && !isOptionalIn && result.value === undefined) {
+     if (isPresent && !isOptionalIn && result.value === undefined) {
Tests ran:
    partial with mask
    partial with mask -- ignore falsy values
    catch/prefault/default
  and 5 more tests!
