[NoCoverage] BlockStatement
packages/zod/src/v4/core/util.ts:663:78
-         if (Object.getOwnPropertyDescriptor(existingShape, key) !== undefined) {
-           throw new Error("Cannot overwrite keys on object schemas containing refinements. Use `.safeExtend()` instead.");
-         }
+         if (Object.getOwnPropertyDescriptor(existingShape, key) !== undefined) {}

[NoCoverage] StringLiteral
packages/zod/src/v4/core/util.ts:664:25
-           throw new Error("Cannot overwrite keys on object schemas containing refinements. Use `.safeExtend()` instead.");
+           throw new Error("");

[Survived] ConditionalExpression
packages/zod/src/v4/core/util.ts:657:21
-     const hasChecks = checks && checks.length > 0;
+     const hasChecks = false;
Tests ran:
    extend() should return schema with new key
    extend() should have power to override existing key
    extend() on object with refinements should not throw when adding new keys

[Survived] ConditionalExpression
packages/zod/src/v4/core/util.ts:657:31
-     const hasChecks = checks && checks.length > 0;
+     const hasChecks = checks && true;
Tests ran:
    extend() on object with refinements should not throw when adding new keys

[Survived] EqualityOperator
packages/zod/src/v4/core/util.ts:657:31
-     const hasChecks = checks && checks.length > 0;
+     const hasChecks = checks && checks.length >= 0;
Tests ran:
    extend() on object with refinements should not throw when adding new keys

[Survived] EqualityOperator
packages/zod/src/v4/core/util.ts:657:31
-     const hasChecks = checks && checks.length > 0;
+     const hasChecks = checks && checks.length <= 0;
Tests ran:
    extend() on object with refinements should not throw when adding new keys

[Survived] ConditionalExpression
packages/zod/src/v4/core/util.ts:658:7
-     if (hasChecks) {
+     if (false) {
Tests ran:
    extend() should return schema with new key
    extend() should have power to override existing key
    extend() on object with refinements should not throw when adding new keys

[Survived] BlockStatement
packages/zod/src/v4/core/util.ts:658:18
-     if (hasChecks) {
-       // Only throw if new shape overlaps with existing shape
-       // Use getOwnPropertyDescriptor to check key existence without accessing values
-       const existingShape = schema._zod.def.shape;
-       for (const key in shape) {
-         if (Object.getOwnPropertyDescriptor(existingShape, key) !== undefined) {
-           throw new Error("Cannot overwrite keys on object schemas containing refinements. Use `.safeExtend()` instead.");
-         }
-       }
-     }
+     if (hasChecks) {}
Tests ran:
    extend() on object with refinements should not throw when adding new keys

[Survived] BlockStatement
packages/zod/src/v4/core/util.ts:662:30
-       for (const key in shape) {
-         if (Object.getOwnPropertyDescriptor(existingShape, key) !== undefined) {
-           throw new Error("Cannot overwrite keys on object schemas containing refinements. Use `.safeExtend()` instead.");
-         }
-       }
+       for (const key in shape) {}
Tests ran:
    extend() on object with refinements should not throw when adding new keys

[Survived] ConditionalExpression
packages/zod/src/v4/core/util.ts:663:11
-         if (Object.getOwnPropertyDescriptor(existingShape, key) !== undefined) {
+         if (false) {
Tests ran:
    extend() on object with refinements should not throw when adding new keys

[Survived] StringLiteral
packages/zod/src/v4/core/util.ts:672:24
-         assignProp(this, "shape", _shape); // self-caching
+         assignProp(this, "", _shape); // self-caching
Tests ran:
    extend() should return schema with new key
    extend() should have power to override existing key
