[Survived] ConditionalExpression
packages/zod/src/v4/core/schemas.ts:2800:23
-             const str = typeof o === "string" ? o : o ? o.toString() : String(o);
+             const str = false ? o : o ? o.toString() : String(o);
Ran all tests for this mutant.

[Survived] StringLiteral
packages/zod/src/v4/core/schemas.ts:2800:36
-             const str = typeof o === "string" ? o : o ? o.toString() : String(o);
+             const str = typeof o === "" ? o : o ? o.toString() : String(o);
Ran all tests for this mutant.
