[Survived] ArrayDeclaration
packages/zod/src/v4/core/to-json-schema.ts:384:25
-                     path: [...params.path, "items"],
+                     path: [],
Tests ran:
    toJSONSchema tuple with rest

[Survived] StringLiteral
packages/zod/src/v4/core/to-json-schema.ts:384:42
-                     path: [...params.path, "items"],
+                     path: [...params.path, ""],
Tests ran:
    toJSONSchema tuple with rest

[Survived] ArrayDeclaration
packages/zod/src/v4/core/to-json-schema.ts:393:25
-                     path: [...params.path, "items"],
+                     path: [],
Tests ran:
    toJSONSchema tuple with rest openapi

[Survived] StringLiteral
packages/zod/src/v4/core/to-json-schema.ts:393:42
-                     path: [...params.path, "items"],
+                     path: [...params.path, ""],
Tests ran:
    toJSONSchema tuple with rest openapi
