[Survived] ConditionalExpression
zod/src/v3/types.ts:4091:9
       return INVALID;
     }
 
-    if (!this.#cache) {
+    if (true) {
       this.#cache = new Set(this._def.values);
     }

[Survived] ConditionalExpression
zod/src/v3/types.ts:4091:9
       return INVALID;
     }
 
-    if (!this.#cache) {
+    if (false) {
       this.#cache = new Set(this._def.values);
     }

[Survived] BooleanLiteral
zod/src/v3/types.ts:4095:9
       this.#cache = new Set(this._def.values);
     }
 
-    if (!this.#cache.has(input.data)) {
+    if (this.#cache.has(input.data)) {
       const ctx = this._getOrReturnCtx(input);
       const expectedValues = this._def.values;

[Survived] ConditionalExpression
zod/src/v3/types.ts:4095:9
       this.#cache = new Set(this._def.values);
     }
 
-    if (!this.#cache.has(input.data)) {
+    if (false) {
       const ctx = this._getOrReturnCtx(input);
       const expectedValues = this._def.values;

[Survived] BooleanLiteral
zod/src/v3/types.ts:4190:9
       return INVALID;
     }
 
-    if (!this.#cache) {
+    if (this.#cache) {
       this.#cache = new Set(util.getValidEnumValues(this._def.values));
     }

[Survived] ConditionalExpression
zod/src/v3/types.ts:4426:13
         return { status: status.value, value: result };
       } else {
         return this._def.schema._parseAsync({ data: ctx.data, path: ctx.path, parent: ctx }).then((base) => {
-        if (!isValid(base)) return INVALID;
+        if (true) return INVALID;
 
           return Promise.resolve(effect.transform(base.value, checkCtx)).then((result) => ({

[Survived] ConditionalExpression
zod/src/v3/types.ts:4426:13
         return { status: status.value, value: result };
       } else {
         return this._def.schema._parseAsync({ data: ctx.data, path: ctx.path, parent: ctx }).then((base) => {
-        if (!isValid(base)) return INVALID;
+        if (false) return INVALID;
 
           return Promise.resolve(effect.transform(base.value, checkCtx)).then((result) => ({
